---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarBendingDetail
source: html/a9e46b4b-7e43-4ed6-b556-b6fcd23e7d05.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetail

Utility class with methods needed for the bending details in view.

## Syntax (C#)
```csharp
public static class RebarBendingDetail
```